Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten (Flatten)            (None, 784)               0         
_________________________________________________________________
activation (Activation)      (None, 784)               0         
_________________________________________________________________
dense (Dense)                (None, 800)               628000    
_________________________________________________________________
activation_1 (Activation)    (None, 800)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 10)                8010      
_________________________________________________________________
activation_2 (Activation)    (None, 10)                0         
=================================================================
Total params: 636,010
Trainable params: 636,010
Non-trainable params: 0
_________________________________________________________________
